[
    {
        "id": "MarcoDorigo",
        "title": "Primi passi con Linux",
        "when": "14:00",
        "where": "Aula Base",
        "speakers": [
            {
                "who": "Marco Dorigo",
                "web": "http://informaticalibera.info"
            }
        ],
        "abstract": "Ci siamo lasciati convincere dall'immancabile amico smanettone e finalmente abbiamo installato Linux. Subito cominciano le cattive notizie: &egrave; diverso da Windows! Ma dove sono i nostri programmi? Perch&egrave; xyz.exe non si installa? Come si installa nuovo software? E se non funzionano le periferiche? Come si fa ad \"andare su Internet\"? Introduzione alla sopravvivenza in ambienti (operativi) ostili."
    },
    {
        "id": "GuidoAudino",
        "title": "Installiamo insieme Debian",
        "when": "15:00",
        "where": "Aula Base",
        "speakers": [
            {
                "who": "Guido Audino",
                "web": "http://www.mag4.it/chisiamo/struttura/309-rete-computer.html"
            }
        ],
        "abstract": "Installazione dal vivo di Debian Live 7.0 LXDE, utile per verificare la compatibilit&agrave; dell'hardware, adatta a computer nuovi o un po' datati, facile da mantenere aggiornata: insomma un ottimo esempio di Software libero!"
    },
    {
        "id": "MassimoNuvoli",
        "title": "Come &egrave; strutturato un Sistema GNU/Linux",
        "when": "16:00",
        "where": "Aula Base",
        "speakers": [
            {
                "who": "Massimo Nuvoli",
                "email": "maxnuv@gmail.com"
            }
        ],
        "abstract": "Conoscere come &egrave; fatto GNU/Linux potrebbe esservi utile per non fare errori durante l'installazione, o  banalmente per sfruttarlo meglio.<br/>Vediamo di capire semplicemente come &egrave; fatto, seguendolo dall'accensione al lancio di una applicazione in ambiente grafico.<br/>Cercheremo anche di dare risposte a domande come \"32 o 64 bit?\" o \"metto tutto in una partizione?\" e altre che emergeranno durante la conversazione."
    },
    {
        "id": "MarcoBodrato",
        "title": "Corsi Online per Insegnanti",
        "when": "17:00",
        "where": "Aula Base",
        "speakers": [
            {
                "who": "Marco Bodrato"
            },
            {
                "who": "Nicola Franzese"
            }
        ],
        "abstract": "Breve storia del percorso che dalla legge regionale sul Software Libero ha portato alla piattaforma <a href=\"http://www.teachmood.it/\">teachmood.it</a> e alla realizzazione di corsi per i docenti su diversi software liberi utilizzabili nella didattica. Presentazione della piattaforma e dei corsi."
    },
    {
        "id": "GiorgioFerrero",
        "title": "Fotografia Digitale",
        "when": "14:00",
        "where": "Aula Medium",
        "speakers": [
            {
                "who": "Giorgio Ferrero"
            }
        ],
        "abstract": "Panoramiche a 360 gradi con utilizzo del programma Hugin Panorama photo stitcher e Gimp per ritocco finale del cielo blu ed esportazione in jpeg compresso. Utilizzo di fotocamera digitale non reflex con obiettivi intercambiabili, utilizzo di vecchi obiettivi (di 40 anni fa) a focale fissa (non zoom), esposizione manuale e messa a fuoco manuale (fatta una sola volta per tutte le foto), uso del cavalletto, filo telecomando per scatti antivibrazioni."
    },
    {
        "id": "Simone Capodicasa",
        "title": "Il terminale per tutti",
        "when": "15:00",
        "where": "Aula Medium",
        "speakers": [
            {
                "who": "Simone Capodicasa",
                "twitter": "followCheip"
            }
        ],
        "abstract": "Un talk per \"assaggiare\" la potenza del terminale, farvi venire la voglia di utilizzare questo strumento nella vita quotidiana e consigliarvi qualche trucchetto."
    },
    {
        "id": "FedericoFissore",
        "title": "Arduino Y&uacute;n",
        "when": "16:00",
        "where": "Aula Medium",
        "speakers": [
            {
                "who": "Federico Fissore",
                "twitter": "fridrik",
                "web": "http://fissore.org/"
            }
        ],
        "abstract": "Introduzione ad Arduino Y&uacute;n, la prima scheda Arduino dotata di un processore dedicato a Linux che affianca e potenzia le capacit&agrave; del microcontrollore."
    },
    {
        "id": "IronBishop",
        "title": "Quante ne sai?",
        "when": "17:00",
        "where": "Aula Medium",
        "speakers": [
            {
                "who": "IronBishop",
                "web": "http://fsfe.org/fellowship/"
            },
            {
                "who": "Abacus",
                "web": "http://isoardi.info/"
            }
        ],
        "abstract": "Torna a grande richiesta il talk interattivo tra hacking e fooling: \"premi la patata\" e rispondi alle domande! Quante <em>SLOC</em> ci sono in Debian? <em>Kryptonite</em> &egrave; un manuale di ...? Qual &egrave; la nave pi&ugrave; <em>veloce</em> della galassia? Ispirato senza ritegno ai blasonati contest della costa ovest: un'oretta di svago tra nozioni tecniche, meno tecniche e decisamente bizzarre. Ricchi premi e cotillons. Con il supporto di: <a href=\"http://www.raspberrypi.org\" target=\"_blank\">Raspberry Pi</a>, <a href=\"http://nodejs.org/\" target=\"_blank\">node.js</a> e gli immancabili, celeberrimi biscotti."
    },
    {
        "id": "DavideMainardi",
        "title": "Privacy ed anonimato su Internet",
        "when": "14:00",
        "where": "Aula Advanced",
        "speakers": [
            {
                "who": "Davide Mainardi",
                "twitter": "ingMainardi"
            }
        ],
        "abstract": "Il talk si prefigge di illustrare il modo in cui le nostre informazioni personali viaggino in rete: il tracking, il filter-bubbling dei motori di ricerca ed il caso PRISM. Successivamente si presenteranno tecniche e software open-source per navigare al sicuro da ogni tracciabilit&agrave; ed eventualmente in anonimato."
    },
    {
        "id": "MarcoZanasso",
        "title": "Asterisk: centralino VoIP FLOSS",
        "when": "15:00",
        "where": "Aula Advanced",
        "speakers": [
            {
                "who": "Marco Zanasso",
                "web": "http://www.itfor.it/",
                "email": "marco.zanasso@itfor.it"
            }
        ],
        "abstract": "Configurazione di un centralino telefonico (PBX) basato su Asterisk comprensivo di periferiche (telefoni VoIP, PortAdapter analogici, GSMbox, ecc.). Non tutti sanno che con un PC, GNU/Linux e Asterisk è possibile realizzare un centralino telefonico. Poche nozioni teoriche per passare subito alla configurazione del PBX Asterisk e delle periferiche che saranno utilizzate in diretta dai partecipanti."
    },
    {
        "id": "DimitriBellini",
        "title": "Zabbix: Monitoring is possible",
        "when": "16:00",
        "where": "Aula Advanced",
        "speakers": [
            {
                "who": "Dimitri Bellini",
                "web": "http://www.quadrata.it/",
                "email": "dimitri.bellini@quadrata.it"
            }
        ],
        "abstract": "Introduzione a Zabbix, soluzione di Monitoring Opensource adattabile a varie realta', dal privato all'Enterprise. Concetti, caratteristiche di base e scenari di utilizzo."
    },
    {
        "id": "PaoloDoz",
        "title": "Fastboot in sistemi embedded",
        "when": "17:00",
        "where": "Aula Advanced",
        "speakers": [
            {
                "who": "Paolo Doz",
                "web": "http://www.abinsula.com/",
                "email": "paolo.doz@abinsula.com"
            },
            {
                "who": "Ilario Pittau",
                "web": "http://www.abinsula.com/",
                "email": "ilario.pittau@abinsula.com"
            }
        ],
        "abstract": "Il talk ha l'obiettivo di introdurre le tecniche utilizzate per ottimizzare la sequenza di startup di un sistema embedded. Si partir&agrave; con la descrizione del bootloader (u-boot), passando per la configurazione del kernel e infine descrivendo la gestione dell'avvio di servizi in user space (systemd)."
    },
    {
        "id": "Giulio",
        "title": "MITM e webapp",
        "when": "14:00",
        "where": "Aula Sikurezza",
        "speakers": [
            {
                "who": "Giulio"
            }
        ],
        "abstract": "Partendo da concetti di base come ARP ed SSL si parler&agrave; di tecniche di MITM in relazione con le tecnologie web con dimostrazioni pratiche e suggerimenti sia per la sicurezza personale sia che per quella della propria infrastruttura."
    },
    {
        "id": "KeivanMotavalli",
        "title": "Quando il nuovo rende insicure le VPN",
        "when": "15:00",
        "where": "Aula Sikurezza",
        "speakers": [
            {
                "who": "Keivan Motavalli"
            }
        ],
        "abstract": "Sfruttando il poco conosciuto IPv6 si pu&ograve; creare una condizione di rete per la quale il traffico, normalmente diretto su una vpn sicura, viene deviato verso un proxy dell'attaccante."
    },
    {
        "id": "PaoloStagno",
        "title": "Penetration Test con Kali Linux",
        "when": "16:00",
        "where": "Aula Sikurezza",
        "speakers": [
            {
                "who": "Paolo Stagno",
                "web": "http://voidsec.com",
                "email": "voidsec@voidsec.com"
            },
            {
                "who": "Luca Poletti"
            }
        ],
        "abstract": "Il crescente trend dei cyber attacchi pone a chiunque lavori nel campo IT alcuni importanti quesiti: Quali sono le armi che vengono usate? Siamo pronti? Per rispondere, parleremo di Kali Linux: distribuzione pensata per la sicurezza informatica e i suoi strumenti, che possono identificare una vulnerabilità o compromettere un sitema.  Il talk si snoderà affrontando alcuni aspetti di un attacco informatico, concludendo infine con alcune possibili contromisure."
    },
    {
        "id": "BughardyEagle",
        "title": "Mifare Ultralight: Istruzioni per l'uso",
        "when": "17:00",
        "where": "Aula Sikurezza",
        "speakers": [
            {
                "who": "BugHardy"
            },
            {
                "who": "Eagle"
            }
        ],
        "abstract": "Uno degli utilizzi più comuni dei chip NFC riguarda i sistemi di trasporto pubblico, in cui spesso si può riscontrare una scorretta implementazione del protocollo Mifare Ultralight. Essendo sprovvisto di un sistema di cifratura hardware, è semplice interagire con il chip e accedere ai dati memorizzati sullo stesso. La nostra ricerca si prefigge di illustrare a tutti le caratteristiche di un biglietto NFC Mifare Ultralight ed evidenziare l’utilizzo adeguato dei bytes del settore \"OTP\"."
    },
    {
        "id": "AndreaNegro",
        "title": "I Database non Relazionali",
        "when": "14:00",
        "where": "Aula Cloud",
        "speakers": [
            {
                "who": "Andrea Negro"
            },
            {
                "who": "Mariano Fiorentino"
            }
        ],
        "abstract": "I database non relazionali, pur non essendo una novità assoluta, hanno registrato una crescita esponenziale nel loro sviluppo e utilizzo negli ultimi anni grazie al sempre più crescente bisogno di scalare in orizzontale, dove i classici RDBMS (database relazionali) presentano diverse limitazioni. I giganti del web, che si trovano a dover gestire database di dimensioni veramente imponenti, hanno sviluppato (o contribuito allo sviluppo) vari NRDBMS (database non relazionali)."
    },
    {
        "id": "LucaCipriani",
        "title": "Redis per Linux",
        "when": "15:00",
        "where": "Aula Cloud",
        "speakers": [
            {
                "who": "Luca Cipriani"
            }
        ],
        "abstract": "Redis come sistema di storage di configurazioni, Etcd. Oltre le sessioni: pub/sub (chat), hipache, AWS ElastiCache per Redis. Master/slave config (il problema di Twilio). Redis come logger e/o queue broker (Logstash)"
    },
    {
        "id": "LuigiMaselli",
        "title": "MeteorJS & webapp in Realtime",
        "when": "16:00",
        "where": "Aula Cloud",
        "speakers": [
            {
                "who": "Luigi Maselli",
                "twitter": "grigi0"
            }
        ],
        "abstract": "Le applicazioni web per essere reattive e sicure devono fare controlli sia lato client che lato server, questo comporta duplicazione di codice e spesso l'utilizzo di diversi linguaggi di programmazione. MeteorJS, basato su NodeJS, offre un ambiente unico per poter programmare in javascript codice che potr&agrave; girare indifferentemente sul browser o sul server o su entrambi."
    },
    {
        "id": "AndreaDEste",
        "title": "Plone CMS & Ploomcake",
        "when": "17:00",
        "where": "Aula Cloud",
        "speakers": [
            {
                "who": "Andrea D'Este",
                "web": "http://redomino.com/",
                "twitter": "ade_eddie"
            }
        ],
        "abstract": "Plone &egrave; un gestore di contenuti open source sviluppato in Python. Il suo punto di forza &egrave; la flessibilit&agrave;. Con Plone si possono creare siti web, cataloghi prodotti, intranet, gestori documentali, gestori di progetti. Vediamo insieme alcuni esempi da fare in 10 minuti partendo da Ploomcake, una distribuzione Plone."
    }
]
